app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
		@class = SchoolClass.find(params[:id])

INSERT INTO "school_classes" DEFAULT VALUES
---
    def create
        @class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
        @class.title = params[:school_class][:title]
        @class.room_number = params[:school_class][:room_number]
        @class.save